Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMsc_bf.h
/** \brief Offset for Ifx_MSC_ISC_Bits.CDTFI */
#define IFX_MSC_ISC_CDTFI_OFF (2u)

/** \brief Length for Ifx_MSC_ISC_Bits.CURDI */
#define IFX_MSC_ISC_CURDI_LEN (1u)

/** \brief Mask for Ifx_MSC_ISC_Bits.CURDI */
#define IFX_MSC_ISC_CURDI_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISC_Bits.CURDI */
#define IFX_MSC_ISC_CURDI_OFF (3u)

/** \brief Length for Ifx_MSC_ISC_Bits.CDP */
#define IFX_MSC_ISC_CDP_LEN (1u)

/** \brief Mask for Ifx_MSC_ISC_Bits.CDP */
#define IFX_MSC_ISC_CDP_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISC_Bits.CDP */
#define IFX_MSC_ISC_CDP_OFF (4u)

/** \brief Length for Ifx_MSC_ISC_Bits.CCP */
#define IFX_MSC_ISC_CCP_LEN (1u)

/** \brief Mask for Ifx_MSC_ISC_Bits.CCP */
#define IFX_MSC_ISC_CCP_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISC_Bits.CCP */
#define IFX_MSC_ISC_CCP_OFF (5u)

/** \brief Length for Ifx_MSC_ISC_Bits.CDDIS */
#define IFX_MSC_ISC_CDDIS_LEN (1u)

/** \brief Mask for Ifx_MSC_ISC_Bits.CDDIS */
#define IFX_MSC_ISC_CDDIS_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISC_Bits.CDDIS */
#define IFX_MSC_ISC_CDDIS_OFF (6u)

/** \brief Length for Ifx_MSC_ISC_Bits.SDEDI */
#define IFX_MSC_ISC_SDEDI_LEN (1u)

/** \brief Mask for Ifx_MSC_ISC_Bits.SDEDI */
#define IFX_MSC_ISC_SDEDI_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISC_Bits.SDEDI */
#define IFX_MSC_ISC_SDEDI_OFF (16u)

/** \brief Length for Ifx_MSC_ISC_Bits.SDECI */
#define IFX_MSC_ISC_SDECI_LEN (1u)

/** \brief Mask for Ifx_MSC_ISC_Bits.SDECI */
#define IFX_MSC_ISC_SDECI_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISC_Bits.SDECI */
#define IFX_MSC_ISC_SDECI_OFF (17u)

/** \brief Length for Ifx_MSC_ISC_Bits.SDTFI */
#define IFX_MSC_ISC_SDTFI_LEN (1u)

/** \brief Mask for Ifx_MSC_ISC_Bits.SDTFI */
#define IFX_MSC_ISC_SDTFI_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISC_Bits.SDTFI */
#define IFX_MSC_ISC_SDTFI_OFF (18u)

/** \brief Length for Ifx_MSC_ISC_Bits.SURDI */
#define IFX_MSC_ISC_SURDI_LEN (1u)

/** \brief Mask for Ifx_MSC_ISC_Bits.SURDI */
#define IFX_MSC_ISC_SURDI_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISC_Bits.SURDI */
#define IFX_MSC_ISC_SURDI_OFF (19u)

/** \brief Length for Ifx_MSC_ISC_Bits.SDP */
#define IFX_MSC_ISC_SDP_LEN (1u)

/** \brief Mask for Ifx_MSC_ISC_Bits.SDP */
#define IFX_MSC_ISC_SDP_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISC_Bits.SDP */
#define IFX_MSC_ISC_SDP_OFF (20u)

/** \brief Length for Ifx_MSC_ISC_Bits.SCP */
#define IFX_MSC_ISC_SCP_LEN (1u)

/** \brief Mask for Ifx_MSC_ISC_Bits.SCP */
#define IFX_MSC_ISC_SCP_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISC_Bits.SCP */
#define IFX_MSC_ISC_SCP_OFF (21u)

/** \brief Length for Ifx_MSC_ISC_Bits.SDDIS */
#define IFX_MSC_ISC_SDDIS_LEN (1u)

/** \brief Mask for Ifx_MSC_ISC_Bits.SDDIS */
#define IFX_MSC_ISC_SDDIS_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ISC_Bits.SDDIS */
#define IFX_MSC_ISC_SDDIS_OFF (22u)

/** \brief Length for Ifx_MSC_OCR_Bits.CLP */
#define IFX_MSC_OCR_CLP_LEN (1u)

/** \brief Mask for Ifx_MSC_OCR_Bits.CLP */
#define IFX_MSC_OCR_CLP_MSK (0x1u)

/** \brief Offset for Ifx_MSC_OCR_Bits.CLP */
#define IFX_MSC_OCR_CLP_OFF (0u)

/** \brief Length for Ifx_MSC_OCR_Bits.SLP */
#define IFX_MSC_OCR_SLP_LEN (1u)

/** \brief Mask for Ifx_MSC_OCR_Bits.SLP */
#define IFX_MSC_OCR_SLP_MSK (0x1u)

/** \brief Offset for Ifx_MSC_OCR_Bits.SLP */
#define IFX_MSC_OCR_SLP_OFF (1u)

/** \brief Length for Ifx_MSC_OCR_Bits.CSLP */
#define IFX_MSC_OCR_CSLP_LEN (1u)

/** \brief Mask for Ifx_MSC_OCR_Bits.CSLP */
#define IFX_MSC_OCR_CSLP_MSK (0x1u)

/** \brief Offset for Ifx_MSC_OCR_Bits.CSLP */
#define IFX_MSC_OCR_CSLP_OFF (2u)

/** \brief Length for Ifx_MSC_OCR_Bits.ILP */
#define IFX_MSC_OCR_ILP_LEN (1u)

/** \brief Mask for Ifx_MSC_OCR_Bits.ILP */
#define IFX_MSC_OCR_ILP_MSK (0x1u)

/** \brief Offset for Ifx_MSC_OCR_Bits.ILP */
#define IFX_MSC_OCR_ILP_OFF (3u)

/** \brief Length for Ifx_MSC_OCR_Bits.CLKCTRL */
#define IFX_MSC_OCR_CLKCTRL_LEN (1u)

/** \brief Mask for Ifx_MSC_OCR_Bits.CLKCTRL */
#define IFX_MSC_OCR_CLKCTRL_MSK (0x1u)

/** \brief Offset for Ifx_MSC_OCR_Bits.CLKCTRL */
#define IFX_MSC_OCR_CLKCTRL_OFF (8u)

/** \brief Length for Ifx_MSC_OCR_Bits.CSL */
#define IFX_MSC_OCR_CSL_LEN (2u)

/** \brief Mask for Ifx_MSC_OCR_Bits.CSL */
#define IFX_MSC_OCR_CSL_MSK (0x3u)

/** \brief Offset for Ifx_MSC_OCR_Bits.CSL */
#define IFX_MSC_OCR_CSL_OFF (9u)

/** \brief Length for Ifx_MSC_OCR_Bits.CSH */
#define IFX_MSC_OCR_CSH_LEN (2u)

/** \brief Mask for Ifx_MSC_OCR_Bits.CSH */
#define IFX_MSC_OCR_CSH_MSK (0x3u)

/** \brief Offset for Ifx_MSC_OCR_Bits.CSH */
#define IFX_MSC_OCR_CSH_OFF (11u)

/** \brief Length for Ifx_MSC_OCR_Bits.CSC */
#define IFX_MSC_OCR_CSC_LEN (2u)

/** \brief Mask for Ifx_MSC_OCR_Bits.CSC */
#define IFX_MSC_OCR_CSC_MSK (0x3u)

/** \brief Offset for Ifx_MSC_OCR_Bits.CSC */
#define IFX_MSC_OCR_CSC_OFF (13u)

/** \brief Length for Ifx_MSC_OCR_Bits.SDISEL */
#define IFX_MSC_OCR_SDISEL_LEN (3u)

/** \brief Mask for Ifx_MSC_OCR_Bits.SDISEL */
#define IFX_MSC_OCR_SDISEL_MSK (0x7u)

/** \brief Offset for Ifx_MSC_OCR_Bits.SDISEL */
#define IFX_MSC_OCR_SDISEL_OFF (16u)

/** \brief Length for Ifx_MSC_DSCE_Bits.NDBHE */
#define IFX_MSC_DSCE_NDBHE_LEN (1u)

/** \brief Mask for Ifx_MSC_DSCE_Bits.NDBHE */
#define IFX_MSC_DSCE_NDBHE_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSCE_Bits.NDBHE */
#define IFX_MSC_DSCE_NDBHE_OFF (0u)

/** \brief Length for Ifx_MSC_DSCE_Bits.NDBLE */
#define IFX_MSC_DSCE_NDBLE_LEN (1u)

/** \brief Mask for Ifx_MSC_DSCE_Bits.NDBLE */
#define IFX_MSC_DSCE_NDBLE_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSCE_Bits.NDBLE */
#define IFX_MSC_DSCE_NDBLE_OFF (1u)

/** \brief Length for Ifx_MSC_DSCE_Bits.EXEN */
#define IFX_MSC_DSCE_EXEN_LEN (1u)

/** \brief Mask for Ifx_MSC_DSCE_Bits.EXEN */
#define IFX_MSC_DSCE_EXEN_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSCE_Bits.EXEN */
#define IFX_MSC_DSCE_EXEN_OFF (14u)

/** \brief Length for Ifx_MSC_DSCE_Bits.CCF */
#define IFX_MSC_DSCE_CCF_LEN (1u)

/** \brief Mask for Ifx_MSC_DSCE_Bits.CCF */
#define IFX_MSC_DSCE_CCF_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSCE_Bits.CCF */
#define IFX_MSC_DSCE_CCF_OFF (15u)

/** \brief Length for Ifx_MSC_DSCE_Bits.INJENP0 */
#define IFX_MSC_DSCE_INJENP0_LEN (1u)

/** \brief Mask for Ifx_MSC_DSCE_Bits.INJENP0 */
#define IFX_MSC_DSCE_INJENP0_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSCE_Bits.INJENP0 */
#define IFX_MSC_DSCE_INJENP0_OFF (16u)

/** \brief Length for Ifx_MSC_DSCE_Bits.INJPOSP0 */
#define IFX_MSC_DSCE_INJPOSP0_LEN (6u)

/** \brief Mask for Ifx_MSC_DSCE_Bits.INJPOSP0 */
#define IFX_MSC_DSCE_INJPOSP0_MSK (0x3fu)

